Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ8110CA80144.atdf
      <value-group name="CFGA__DIVREF">
        <value name="DIV1" caption="The reference clock is divided by 1" value="0x0"/>
        <value name="DIV8" caption="The reference clock is divided by 8" value="0x1"/>
      </value-group>
      <value-group name="CTRLC__WINMODE">
        <value name="DISABLE" caption="No window mode (default)" value="0x0"/>
        <value name="MODE1" caption="VALUE &gt; WINLT" value="0x1"/>
        <value name="MODE2" caption="VALUE &lt; WINUT" value="0x2"/>
        <value name="MODE3" caption="WINLT &lt; VALUE &lt; WINUT" value="0x3"/>
        <value name="MODE4" caption="!(WINLT &lt; VALUE &lt; WINUT)" value="0x4"/>
      </value-group>
    </module>
    <module name="FUSES" version="1.0.0" caption="Defines FUSE parameters">
      <register-group name="FUSES_BOOTCFG1" caption="Defines FUSE parameters">
        <register name="BLDRCFG" offset="0x0" rw="RW" size="4" access-size="4" caption="Bootloader Configuration">
          <bitfield name="PFM_BCRP" caption="Boot Configration Page Read Protect" mask="0x1"/>
          <bitfield name="PFM_BCWP" caption="Boot Configration Page Write Protect" mask="0x2"/>
          <bitfield name="BROM_EN_BFMCHK" caption="Enable BFM CRC Check" mask="0x10000000" values="BLDRCFG__BROM_EN_BFMCHK"/>
          <bitfield name="BROM_EN_PLL" caption="Enable PLL (Settings in PLL0_&lt;REGS&gt; are used)" mask="0x20000000"/>
          <bitfield name="BROM_EN_DALUN" caption="Enable DAL Unlock" mask="0x40000000"/>
          <bitfield name="BROM_EN_RWLOCKS" caption="Enable Read/Write Locks" mask="0x80000000"/>
        </register>
        <register name="BROM_BSEQ" offset="0x4" rw="RW" size="4" access-size="4" caption="Boot Configuraiton Page Sequence Number">
          <bitfield name="SEQNUM" caption="Sequence Number" mask="0xFFFF"/>
          <bitfield name="SEQBAR" caption="Sequence Number Bar (Negeated)" mask="0xFFFF0000"/>
        </register>
        <register name="BFM_CHK_TABLEPTR" offset="0x8" rw="RW" size="4" access-size="4" caption="BFM CRC Table Pointer">
        </register>
        <register name="KEYVAL_TZ0_CE_ALL" offset="0x80" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Key for TZ0_ALL">
        </register>
        <register name="CELOCK_TZ0_CE_ALL" offset="0x90" rw="RW" size="4" access-size="4" count="4" caption="Chip Erase Lock for TZ0_ALL">
        </register>
        <register name="KEYVAL_CRCCMD" offset="0xA0" rw="RW" size="4" access-size="4" count="4" caption="CRC Access Key">
        </register>
        <register name="KEYCONFIG_CRCCMD" offset="0xB0" rw="RW" size="4" access-size="4" count="4" caption="CRC Access Key Configuration">
        </register>
        <register name="KEYVAL_HOSTDALELEV" offset="0xC0" rw="RW" size="4" access-size="4" count="4" caption="Host Authenticated DAL Elevation Key">
        </register>
        <register name="KEYCONFIG_HOSTDALELEV" offset="0xD0" rw="RW" size="4" access-size="4" count="4" caption="Host Authenticated DAL Elevation Key Configuration">
        </register>
        <register name="ROM_CTRLA" offset="0xE0" rw="RW" size="4" access-size="4" caption="ROM CTRLA Settings  (BROM_PLLEN must be set)">
          <bitfield name="SWRST" caption="Software Reset" mask="0x2"/>
          <bitfield name="ENABLE" caption="Module Enable" mask="0x4"/>
          <bitfield name="PRMWS" caption="Wait States" mask="0x700"/>
        </register>
        <register name="FCR_CTRLA" offset="0xE4" rw="RW" size="4" access-size="4" caption="FCR CTRLA Settings (BROM_PLLEN must be set)">
          <bitfield name="ARB" caption="AHB Arbitration scheme" mask="0x4"/>
          <bitfield name="FWS" caption="Flash Access Time Defined in terms of AHB Clock Wait States" mask="0xF00"/>
          <bitfield name="ADRWS" caption="Address Wait State Enable" mask="0x4000"/>
          <bitfield name="AUTOWS" caption="Automatic Wait State Enable." mask="0x8000"/>
          <bitfield name="RDBUFWS" caption="Data returned from the Read Buffer match the Flash Wait States" mask="0xF0000"/>
        </register>
        <register name="RPMU_VREGCTRL" offset="0xE8" rw="RW" size="4" access-size="4" caption="RPMU VREGCTRL Settings (BROM_PLLEN must be set)">
          <bitfield name="VREGOUT" caption="VREG Output Control in RUN mode only. Enable by production fuse by CALSUPC.VREGOUTEN" mask="0x3" values="RPMU_VREGCTRL__VREGOUT"/>
          <bitfield name="OFFSTDBY" caption="Off in Standby Control for VREGSW[N-1]. Useful for Riverside only." mask="0x4" values="RPMU_VREGCTRL__OFFSTDBY"/>
          <bitfield name="LVSTDBY" caption="Low Voltage Standby Enable" mask="0x10" values="RPMU_VREGCTRL__LVSTDBY"/>
          <bitfield name="LVHIB" caption="Low Voltage Hibernate Enable" mask="0x20" values="RPMU_VREGCTRL__LVHIB"/>
          <bitfield name="CPEN" caption="Charge Pump Enable and Auto-enable." mask="0x700"/>
          <bitfield name="ULDOEN" caption="User LDO Voltage Regulator Enable" mask="0x1000"/>
          <bitfield name="ULDOSTDBY" caption="User LDO Voltage Regulator Configuration" mask="0x2000" values="RPMU_VREGCTRL__ULDOSTDBY"/>
          <bitfield name="ULDOLEVEL" caption="User LDO Voltage Level Selection" mask="0xC000" values="RPMU_VREGCTRL__ULDOLEVEL"/>
          <bitfield name="AVREGEN" caption="Additional Voltage Regulator Enable" mask="0x70000"/>
          <bitfield name="AVREGSTDBY" caption="Additional Voltage Regulator Configuration" mask="0x7000000" values="RPMU_VREGCTRL__AVREGSTDBY"/>
        </register>
        <register name="PLL0_CTRL" offset="0xEC" rw="RW" size="4" access-size="4" caption="PLL0 CTRL Settings (BROM_PLLEN must be set)">
          <bitfield name="ENABLE" caption="PLL Enable" mask="0x2"/>
          <bitfield name="WRTLOCK" caption="Write Lock" mask="0x4"/>
          <bitfield name="ONDEMAND" caption="On Demand Control" mask="0x80"/>
          <bitfield name="REFSEL" caption="Reference selection" mask="0x700" values="PLL0_CTRL__REFSEL"/>
          <bitfield name="BWSEL" caption="Bandwidth selection" mask="0x3800" values="PLL0_CTRL__BWSEL"/>
        </register>
        <register name="PLL0_FBDIV" offset="0xF0" rw="RW" size="4" access-size="4" caption="PLL0 FBDIV Settings (BROM_PLLEN must be set)">
          <bitfield name="FBDIV" caption="PLL Feed-Back Divider Factor" mask="0x3FF"/>
        </register>
        <register name="PLL0_REFDIV" offset="0xF4" rw="RW" size="4" access-size="4" caption="PLL0 REFDIV Settings (BROM_PLLEN must be set)">
          <bitfield name="REFDIV" caption="PLL reference division factor" mask="0x3F"/>
        </register>
