Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA80_DFP/1.0.17/CA80/atdf/PIC32CZ8110CA80144.atdf
    <module name="TPI" id="SYSTEM_IP" version="1.0.0" caption="Trace Port Interface Register">
      <register-group name="TPI" caption="Trace Port Interface Register">
        <register name="SSPSR" offset="0x0" rw="R" size="4" access-size="4" caption="Supported Parallel Port Size Register">
        </register>
        <register name="CSPSR" offset="0x4" rw="RW" size="4" access-size="4" caption="Current Parallel Port Size Register">
        </register>
        <register name="ACPR" offset="0x10" rw="RW" size="4" access-size="4" caption="Asynchronous Clock Prescaler Register">
          <bitfield name="PRESCALER" caption="" mask="0x1FFF"/>
        </register>
        <register name="SPPR" offset="0xF0" rw="RW" size="4" access-size="4" caption="Selected Pin Protocol Register">
          <bitfield name="TXMODE" caption="" mask="0x3"/>
        </register>
        <register name="FFSR" offset="0x300" rw="R" size="4" access-size="4" caption="Formatter and Flush Status Register">
          <bitfield name="FlInProg" caption="" mask="0x1"/>
          <bitfield name="FtStopped" caption="" mask="0x2"/>
          <bitfield name="TCPresent" caption="" mask="0x4"/>
          <bitfield name="FtNonStop" caption="" mask="0x8"/>
        </register>
        <register name="FFCR" offset="0x304" rw="RW" size="4" access-size="4" caption="Formatter and Flush Control Register">
          <bitfield name="EnFCont" caption="" mask="0x2"/>
          <bitfield name="TrigIn" caption="" mask="0x100"/>
        </register>
        <register name="FSCR" offset="0x308" rw="R" size="4" access-size="4" caption="Formatter Synchronization Counter Register">
        </register>
        <register name="TRIGGER" offset="0xEE8" rw="R" size="4" access-size="4" caption="TRIGGER">
          <bitfield name="TRIGGER" caption="" mask="0x1"/>
        </register>
        <register name="FIFO0" offset="0xEEC" rw="R" size="4" access-size="4" caption="Integration ETM Data">
          <bitfield name="ETM0" caption="" mask="0xFF"/>
          <bitfield name="ETM1" caption="" mask="0xFF00"/>
          <bitfield name="ETM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITATBCTR2" offset="0xEF0" rw="R" size="4" access-size="4" caption="ITATBCTR2">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="ITATBCTR0" offset="0xEF8" rw="R" size="4" access-size="4" caption="ITATBCTR0">
          <bitfield name="ATREADY" caption="" mask="0x1"/>
        </register>
        <register name="FIFO1" offset="0xEFC" rw="R" size="4" access-size="4" caption="Integration ITM Data">
          <bitfield name="ITM0" caption="" mask="0xFF"/>
          <bitfield name="ITM1" caption="" mask="0xFF00"/>
          <bitfield name="ITM2" caption="" mask="0xFF0000"/>
          <bitfield name="ETM_bytecount" caption="" mask="0x3000000"/>
          <bitfield name="ETM_ATVALID" caption="" mask="0x4000000"/>
          <bitfield name="ITM_bytecount" caption="" mask="0x18000000"/>
          <bitfield name="ITM_ATVALID" caption="" mask="0x20000000"/>
        </register>
        <register name="ITCTRL" offset="0xF00" rw="RW" size="4" access-size="4" caption="Integration Mode Control">
          <bitfield name="Mode" caption="" mask="0x1"/>
        </register>
        <register name="CLAIMSET" offset="0xFA0" rw="RW" size="4" access-size="4" atomic-op="set:CLAIMSET" caption="Claim tag set">
        </register>
        <register name="CLAIMCLR" offset="0xFA4" rw="RW" size="4" access-size="4" atomic-op="clear:CLAIMCLR" caption="Claim tag clear">
        </register>
        <register name="DEVID" offset="0xFC8" rw="R" size="4" access-size="4" caption="TPIU_DEVID">
          <bitfield name="NrTraceInput" caption="" mask="0x1"/>
          <bitfield name="AsynClkIn" caption="" mask="0x20"/>
          <bitfield name="MinBufSz" caption="" mask="0x1C0"/>
          <bitfield name="PTINVALID" caption="" mask="0x200"/>
          <bitfield name="MANCVALID" caption="" mask="0x400"/>
          <bitfield name="NRZVALID" caption="" mask="0x800"/>
        </register>
        <register name="DEVTYPE" offset="0xFCC" rw="R" size="4" access-size="4" caption="TPIU_DEVTYPE">
          <bitfield name="SubType" caption="" mask="0xF"/>
          <bitfield name="MajorType" caption="" mask="0xF0"/>
        </register>
      </register-group>
    </module>
    <module name="TRAM" id="03938" name2="drm_tram_u2801_v2" version="2a0" caption="TrustRAM">
      <register-group name="TRAM" caption="TrustRAM">
        <register name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="TAMPERS" caption="Tamper Erase" mask="0x10"/>
          <bitfield name="DRP" caption="Data Remanence Prevention" mask="0x40"/>
          <bitfield name="SILACC" caption="Silent Access" mask="0x80"/>
        </register>
        <register name="INTENCLR" offset="0x4" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTENSET" offset="0x8" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00000000" caption="Interrupt Enable Set">
          <bitfield name="ERR" caption="TrustRAM Readout Error Interrupt Enable" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended Interrupt Enable" mask="0x2"/>
        </register>
        <register name="INTFLAG" offset="0xC" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000000" caption="Interrupt Flag Status and Clear">
          <bitfield name="ERR" caption="TrustRAM Readout Error" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ended" mask="0x2"/>
        </register>
        <register name="STATUS" offset="0x10" rw="R" size="4" initval="0x00000000" caption="Status">
          <bitfield name="RAMINV" caption="RAM Inversion Bit" mask="0x1"/>
          <bitfield name="DRP" caption="Data Remanence Prevention Ongoing" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0x14" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
        </register>
        <register name="DSCC" offset="0x18" rw="W" size="4" initval="0x00000000" caption="Data Scramble Control">
          <bitfield name="DSCKEY" caption="Data Scramble Key" mask="0x3FFFFFFF"/>
          <bitfield name="DSCEN" caption="Data Scramble Enable" mask="0x80000000"/>
        </register>
        <register name="PERMW" offset="0x1C" rw="W" size="4" initval="0x00000000" caption="Permutation Write">
          <bitfield name="DATA" caption="Permutation Scrambler Data Input" mask="0x7"/>
        </register>
        <register name="PERMR" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Permutation Read">
          <bitfield name="DATA" caption="Permutation Scrambler Data Output" mask="0x7"/>
        </register>
        <register name="RAM" offset="0x1000" rw="RW" size="4" count="2048" initval="0x00000000" caption="TrustRAM">
          <bitfield name="DATA" caption="Trust RAM Data" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
    </module>
    <module name="TRNG" id="03597" name2="math_trng_u2242_v1" version="1d0" caption="True Random Generator">
      <register-group name="TRNG" caption="True Random Generator">
        <register name="CTRLA" offset="0x0" rw="RW" size="1" initval="0x00" caption="Control A">
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x40"/>
        </register>
